export const ContractText = {

    // 투자심사 제안 (투자사 -> 기업) 관련 동의서 정보
    AUDIT_SUGGEST: {
        PERSONAL_INFO_AGREE: {
            title: '개인정보 동의',
            content:
                '개인정보의 제3자 제공도 꼭 필요한 범위에서 최소한으로 하여야 하며, 제3자 제공 동의를 받는 경우에는 ' +
                '개인정보를 제공받는 자, 제공받는 자의 이용 목적, 제공하는 개인정보 항목 등 중요한 사항은 부호·색채 ' +
                '및 굵고 큰 글자 등으로 명확히 표시하여야 개인정보의 제3자 제공도 꼭 필요한 범위에서 최소한으로 ' +
                '하여야 하며, 제3자 제공 동의를 받는 경우에는 개인정보를 제공받는 자, 제공받는 자의 이용 목적, ' +
                '제공하는 개인정보 항목 등 중요한 사항은 부호·색채 및 굵고 큰 글자 등으로 명확히 표시하여야 ' +
                '개인정보의 제3자 제공도 꼭 필요한 범위에서 최소한으로 하여야 하며, 제3자 제공 동의를 받는 경우에는 ' +
                '개인정보를 제공받는 자, 제공받는 자의 이용 목적, 제공하는 개인정보 항목 등 중요한 사항은 부호·색채 ' +
                '및 굵고 큰 글자 등으로 명확히 표시하여야'
        },
        SERVICE_OFFER_AGREE: {
            title: 'IBK 서비스 제공 동의',
            content:
                '개인정보의 제3자 제공도 꼭 필요한 범위에서 최소한으로 하여야 하며, 제3자 제공 동의를 받는 경우에는 ' +
                '개인정보를 제공받는 자, 제공받는 자의 이용 목적, 제공하는 개인정보 항목 등 중요한 사항은 부호·색채 ' +
                '및 굵고 큰 글자 등으로 명확히 표시하여야 개인정보의 제3자 제공도 꼭 필요한 범위에서 최소한으로 ' +
                '하여야 하며, 제3자 제공 동의를 받는 경우에는 개인정보를 제공받는 자, 제공받는 자의 이용 목적, ' +
                '제공하는 개인정보 항목 등 중요한 사항은 부호·색채 및 굵고 큰 글자 등으로 명확히 표시하여야 ' +
                '개인정보의 제3자 제공도 꼭 필요한 범위에서 최소한으로 하여야 하며, 제3자 제공 동의를 받는 경우에는 ' +
                '개인정보를 제공받는 자, 제공받는 자의 이용 목적, 제공하는 개인정보 항목 등 중요한 사항은 부호·색채 ' +
                '및 굵고 큰 글자 등으로 명확히 표시하여야 한다.'
        },
        // COMPANY_UPDATE_INFO_AGREE: {
        //     title: '투자희망기업정보 업데이트 동의',
        //     content:
        //         '개인정보의 제3자 제공도 꼭 필요한 범위에서 최소한으로 하여야 하며, 제3자 제공 동의를 받는 경우에는 ' +
        //         '개인정보를 제공받는 자, 제공받는 자의 이용 목적, 제공하는 개인정보 항목 등 중요한 사항은 부호·색채 ' +
        //         '및 굵고 큰 글자 등으로 명확히 표시하여야 개인정보의 제3자 제공도 꼭 필요한 범위에서 최소한으로 ' +
        //         '하여야 하며, 제3자 제공 동의를 받는 경우에는 개인정보를 제공받는 자, 제공받는 자의 이용 목적, ' +
        //         '제공하는 개인정보 항목 등 중요한 사항은 부호·색채 및 굵고 큰 글자 등으로 명확히 표시하여야 ' +
        //         '개인정보의 제3자 제공도 꼭 필요한 범위에서 최소한으로 하여야 하며, 제3자 제공 동의를 받는 경우에는 ' +
        //         '개인정보를 제공받는 자, 제공받는 자의 이용 목적, 제공하는 개인정보 항목 등 중요한 사항은 부호·색채 ' +
        //         '및 굵고 큰 글자 등으로 명확히 표시하여야 한다.'
        // }
    },

    // 투자심사 요청 (기업 -> 투자사) 관련 동의서 정보
    AUDIT_REQUEST: {
        PERSONAL_INFO_AGREE: {
            title: '개인정보 동의',
            content:
                '개인정보의 제3자 제공도 꼭 필요한 범위에서 최소한으로 하여야 하며, 제3자 제공 동의를 받는 경우에는 ' +
                '개인정보를 제공받는 자, 제공받는 자의 이용 목적, 제공하는 개인정보 항목 등 중요한 사항은 부호·색채 및 ' +
                '굵고 큰 글자 등으로 명확히 표시하여야 개인정보의 제3자 제공도 꼭 필요한 범위에서 최소한으로 하여야 ' +
                '하며, 제3자 제공 동의를 받는 경우에는 개인정보를 제공받는 자, 제공받는 자의 이용 목적, 제공하는 ' +
                '개인정보 항목 등 중요한 사항은 부호·색채 및 굵고 큰 글자 등으로 명확히 표시하여야 개인정보의 제3자 ' +
                '제공도 꼭 필요한 범위에서 최소한으로 하여야 하며, 제3자 제공 동의를 받는 경우에는 개인정보를 제공받는 ' +
                '자, 제공받는 자의 이용 목적, 제공하는 개인정보 항목 등 중요한 사항은 부호·색채 및 굵고 큰 글자 등으로 ' +
                '명확히 표시하여야'
        },
        SERVICE_OFFER_AGREE: {
            title: 'IBK 서비스 제공 동의',
            content:
                '개인정보의 제3자 제공도 꼭 필요한 범위에서 최소한으로 하여야 하며, 제3자 제공 동의를 받는 경우에는 ' +
                '개인정보를 제공받는 자, 제공받는 자의 이용 목적, 제공하는 개인정보 항목 등 중요한 사항은 부호·색채 및 ' +
                '굵고 큰 글자 등으로 명확히 표시하여야 개인정보의 제3자 제공도 꼭 필요한 범위에서 최소한으로 하여야 ' +
                '하며, 제3자 제공 동의를 받는 경우에는 개인정보를 제공받는 자, 제공받는 자의 이용 목적, 제공하는 ' +
                '개인정보 항목 등 중요한 사항은 부호·색채 및 굵고 큰 글자 등으로 명확히 표시하여야 개인정보의 제3자 ' +
                '제공도 꼭 필요한 범위에서 최소한으로 하여야 하며, 제3자 제공 동의를 받는 경우에는 개인정보를 제공받는 ' +
                '자, 제공받는 자의 이용 목적, 제공하는 개인정보 항목 등 중요한 사항은 부호·색채 및 굵고 큰 글자 등으로 ' +
                '명확히 표시하여야 한다.'
        },
        COMPANY_UPDATE_INFO_AGREE: {
            title: '투자희망기업정보 업데이트 동의',
            content:
                '개인정보의 제3자 제공도 꼭 필요한 범위에서 최소한으로 하여야 하며, 제3자 제공 동의를 받는 경우에는 ' +
                '개인정보를 제공받는 자, 제공받는 자의 이용 목적, 제공하는 개인정보 항목 등 중요한 사항은 부호·색채 및 ' +
                '굵고 큰 글자 등으로 명확히 표시하여야 개인정보의 제3자 제공도 꼭 필요한 범위에서 최소한으로 하여야 ' +
                '하며, 제3자 제공 동의를 받는 경우에는 개인정보를 제공받는 자, 제공받는 자의 이용 목적, 제공하는 ' +
                '개인정보 항목 등 중요한 사항은 부호·색채 및 굵고 큰 글자 등으로 명확히 표시하여야 개인정보의 제3자 ' +
                '제공도 꼭 필요한 범위에서 최소한으로 하여야 하며, 제3자 제공 동의를 받는 경우에는 개인정보를 제공받는 ' +
                '자, 제공받는 자의 이용 목적, 제공하는 개인정보 항목 등 중요한 사항은 부호·색채 및 굵고 큰 글자 등으로 ' +
                '명확히 표시하여야 한다.'
        }
    },

    // 간편서류 동의서 정보
    SIMPLE_DOCUMENT: {

    }
}

Object.freeze(ContractText);